app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 5
---
  def index
    @product = Product.order("id ASC").limit(5)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 327 LIMIT 1
---
  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい
    @product = Product.find(params[:id])

SELECT  `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 10
---
  def search ##検索フォーム
    @product = Product.where('title LIKE(?)',"%#{params[:keyword]}%").limit(10)