app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('koko', 1, 'lplp', 327, '2018-03-26 04:37:24', '2018-03-26 04:37:24')
---
  def create
    Review.create(review_params)